Repository: Daniel-KM/Omeka-S-module-Ark
Catalog: language/*.po
Languages: fr

source: The module %1$s should be upgraded to version %2$s or later.
fr: Le module %1$s doit être mis à niveau à la version %2$s ou supérieure.

source: Noid requires the extension "Database (dbm-style) Abstraction Layer" (dba).
fr: Noid a besoin de l’extension php « Database (dbm-style) Abstraction Layer » (dba).

source: Noid requires a compatible dba handler (BerkeleyDB, GDBM, or LMDB): not installed.
fr: Noid a besoin d’un gestionnaire dba compatible (BerkeleyDB, GDBM ou LMDB) : non installé.

source: Ark allows to create and manage unique, universel and persistent ark identifiers.
fr: Ark permet de créer et de gérer des identifiants uniques, universels et pérennes.

source: See %1$sreadme%3$s or %2$sthe original help%3$s for more informations.
fr: Voir %1$sle readme%3$s ou %2$sl’aide originale%3$s pour davantage d’informations.

source: NOID database is already created, which means some settings are not modifiable.
fr: La base de données NOID est déjà créée, ce qui implique qu’il n’est plus possible de modifier les paramètres.

source: To be able to modify them, you have to manually remove the database (located in %s).
fr: Pour pouvoir les modifier, vous devez supprimer la base manuellement (située dans %s).

source: NOID database is already created, but the settings are not the same than in the Omeka database.
fr: La base de données NOID est déjà créée, mais les paramètres ne correspondent pas avec ceux de la base Omeka.

source: Naan: %1$s; Naa: %2$s; Subnaa: %3$s; Template: %4$s.
fr: Naan: %1$s; Naa: %2$s; Subnaa: %3$s; Modèle: %4$s.

source: Ark Policy Statement
fr: Déclaration de politique Ark

source: It is now possible to define a specific property to store arks. Warning: if you change it, old arks won’t be moved (use module {link}Bulk Edit{link_end} for that).
fr: Il est désormais possible de définir une propriété spécifique pour enregistrer les arks. Attention : si vous la changez, les anciens arks ne seront pas automatiquement déplacés dans la nouvelle propriété (utiliser le module {link}Bulk Edit{link_end} pour cela).

source: Failed to dump BerkeleyDB database using db_dump.
fr: Échec de l’export de la base de données BerkeleyDB via db_dump.

source: No data found in BerkeleyDB dump. You may remove existing files in noid directory.
fr: Aucune donnée n’a été trouvée dans le dumping BerkeleyDB. Vous pouvez supprimer les fichiers existants dans le répertoire noid.

source: Failed to import Noid database: {error}
fr: Échec d’import de la base de données Noid : {error}

source: The Noid database has been migrated from BerkeleyDB to {format} using db_dump.
fr: La base de données Noid a été migrée de BerkeleyDB vers {format} à l’aide de db_dump.

source: Cannot read JSON file: {file}
fr: Impossible de lire le fichier JSON : {file}

source: Invalid JSON in file {file}: {error}
fr: Json invalide dans le fichier {file} : {error}

source: No data found in JSON file.
fr: Aucune donnée n’a été trouvée dans le fichier JSON.

source: Failed to import Noid database from JSON: {error}
fr: Échec d’import de la base de données Noid à partir de JSON : {error}

source: The Noid database has been migrated from BerkeleyDB to {format} using noid_data.json.
fr: La base de données Noid a été migrée de BerkeleyDB à {format} en utilisant noid_data.json.

source: A BerkeleyDB Noid database was found but cannot be migrated automatically. Option 1: Install db-util and retry: - With Debian/Ubuntu: `apt install db-util` - With RedHat/Fedora: `dnf install libdb-utils` Option 2: Export to JSON manually and retry: - Use Perl: `perl vendor/daniel-km/noid/scripts/export_bdb_to_json.pl {bdb_file} {json_file}` - Use Python: `python3 vendor/daniel-km/noid/scripts/export_bdb_to_json.py {bdb_file} {json_file}` See {link}Noid4Php documentation{link_end} for details.
fr: Une base de données BerkeleyDB Noid a été trouvée mais ne peut pas être migrée automatiquement. Option 1 : Installer db-util et réessayer : - Avec Debian/Ubuntu : `apt install db-util` - Avec RedHat/Fedora : `dnf install libdb-utils` Option 2 : Exporter manuellement vers JSON et réessayer : - Utiliser Perl : `perl vendor/daniel-km/noid/scripts/export_bdb_to_json.pl {bdb_file} {json_file}` - Utiliser Python : `python3 vendor/daniel-km/noid/scripts/export_bdb_to_json.py {bdb_file} {json_file}` Voir la documentation {link}Noid4Php{link_end} pour plus de détails.

source: Cannot open BerkeleyDB database for migration.
fr: Impossible d’ouvrir la base de données BerkeleyDB pour la migration.

source: The Noid database has been migrated from BerkeleyDB to {format}.
fr: La base de données Noid a été migrée de BerkeleyDB vers {format}.

source: Migration from BerkeleyDB failed: {error}
fr: La migration depuis BerkeleyDB a échoué : {error}

source: Cannot open database: {message}
fr: Impossible d’ouvrir la base : {message}

source: No database
fr: Pas base de données

source: Cannot create an Ark for {resource} #{resource_id}: {message}
fr: Impossible de créer un ark pour la [{resource} #{resource_id}] : {message}

source: Ark set, but not bound [{ark}, {resource} #{resource_id}]: {message}
fr: Ark défini, mais non lié [{ark}, {resource} #{resource_id}] : {message}

source: Ark set, but no reverse bind [{ark}, {resource} #{resource_id}]: {message}
fr: Ark défini, mais sans lien inverse [{ark}, {resource} #{resource_id}] : {message}

source: Cannot create Arks for {count} resources: {message}
fr: Impossible de créer des arks pour {count} resources : {message}

source: Minter exhausted: requested {count} arks, received {received}.
fr: Mineur épuisé : a demandé {count} arks, reçu {received}.

source: No ark available for {resource} #{resource_id}.
fr: Aucun ark disponible pour la {resource} #{resource_id}.

source: Ark set, but not bound [{ark}, resource #{resource_id}]: {message}
fr: Ark défini, mais non lié [{ark}, resource #{resource_id}] : {message}

source: Ark set, but no reverse bind [{ark}, resource #{resource_id}]: {message}
fr: Ark défini, mais sans lien inverse [{ark}, resource #{resource_id}] : {message}

source: Cannot get database info: {message}
fr: Impossible de récupérer les informations de la base : {message}

source: [Unknown user]
fr: [Utilisateur inconnu]

source: {resource} #{resource_id}: Failed to create ARK identifier.
fr: {resource} #{resource_id} : échec de la création de l’identifiant ark.

source: {resource} #{resource_id}: Created ARK identifier {identifier}.
fr: {resource} #{resource_id} : succès de la création de l’identifiant ark {identifier}.

source: Storage backend for the noid database
fr: Stockage de la base de données noid

source: Default (lmdb if available, else xml)
fr: Défaut (lmdb si disponible, sinon xml)

source: Lmdb (fast, bdb replacement)
fr: Lmdb (rapide, remplace bdb)

source: Omeka database (simpler)
fr: Base de données Omeka (plus simple)

source: BerkeleyDb (deprecated, no more fully free)
fr: BerkeleyDb (obsolète, plus entièrement libre)

source: Name processor for resource
fr: Processeur pour le nom ark

source: Internal resource id
fr: Id interne de la ressource

source: Noid Template
fr: Modèle noid

source: Random generator for the noid database when template is random
fr: Générateur aléatoire pour la base de données noid avec un modèle aléatoire

source: Mersenne Twister, better random distribution
fr: Mersenne Twister, meilleure distribution aléatoire

source: Linear Congruential Generator, better compatibility
fr: Générateur congruentiel linéaire, meilleure compatibilité

source: Qualifier for media
fr: Qualifiant pour le média

source: Internal media id
fr: Id interne du média

source: Position of the media
fr: Position du média

source: Format of position for qualifier
fr: Format pour la position du qualifiant

source: A `sprintf` string that will format the media position. It is recommended to use a format with a leading letter to avoid confusion with numeric media id. Furthermore, the position may not be stable: a scanned image may be missing. Finally, if the first media is not marked "1" in the database, use module Easy Admin to fix positions.
fr: Une chaîne `sprintf` pour formater la position du média. Il est recommandé d’utiliser un format avec une lettre initiale pour éviter de confondre avec un numéro de média. De plus, la position peut ne pas être stable : une image scannée peut avoir été oubliée. Enfin, si le premier média n’est pas marqué "1" dans la base de données, utiliser le module Easy Admin pour corriger les positions.

source: Save the ark with qualifier for media
fr: Enregistrer l’ark avec le qualifiant pour le média

source: Property where to store the identifier (usually dcterms:identifier)
fr: Propriété où enregistrer l’identifiant (généralement dcterms:identifier)

source: If changed, you will need to move all existing identifiers to the new property via module Bulk Edit.
fr: Si la propriété est modifiée, vous devrez déplacer tous les identifiants existants dans la nouvelle propriété via le module Bulk Edit.

source: Policy statement
fr: Déclaration de politique

source: Main policy
fr: Politique générale

source: Create ARKs
fr: Créer les ARKs

source: Ark "{ark}" is not correct: check your naan "{naan}", your template, and your processor [{name}].
fr: L’ark « {ark} » n’est pas correct : vérifiez votre naan « {naan} », votre modèle de format et votre processeurs [{name}].

source: No Ark created: check your processor "{name}" [{resource} #{resource_id}].
fr: Ark non créé : vérifier le processeur « {name} » [{resource} #{resource_id}].

source: The proposed ark "{ark}" by the processor "{name}" is not unique [{resource} #{resource_id}].
fr: L’ark proposé « {ark} » par le processeur « {name} » n’est pas unique [{resource} #{resource_id}].

source: Unable to create a unique ark. Check parameters of the processor "{name}" [{resource} #{resource_id}].
fr: Impossible de créer un ark unique. Vérifiez les paramètres du processeur « {name} » [{resource} #{resource_id}].

source: No Ark qualfiier created for media #{media_id}: the item #{item_id} does not have an ark. Update it first.
fr: Qualifiant ark non créé pour le média #{media_id} : l’item #{item_id} ne dispose pas d’ark. Mettez-le à jour d’abord.

source: Unable to create a qualifier for media #{media_id}: option is "dynamic qualifier".
fr: Impossible de créer un qualifiant pour le média #{media_id} : l’option est « dynamic qualifier ».

source: Unable to create a qualifier for media #%1$d. Check the processor "%2$s".
fr: Impossible de créer un qualifiant pour le média #%1$d. Vérifiez le processeur "%2$s".

source: Unable to create a unique ark. Check the processor "{name}" [media #{media_id}].
fr: Impossible de créer un ark unique. Vérifiez le processeur « {name} » [media #{media_id}].

source: ARK creation started in job {link_job}#{job_id}{link_end} ({link_log}logs{link_end}).
fr: La création des arks est lancé dans la tâche {link_job}#{job_id}{link_end} ({link_log}journaux{link_end}).
